src/InformationRegisters/ОборотКанбанов/ОборотКанбанов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборотКанбанов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПередачи</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Оформил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Принял</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Передал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Завершил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Аналог</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗамены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХраненияОтправитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПроизводственноеЗадание/ПроизводственноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственноеЗадание</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГрупповойУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </attributes>
  <attributes>
    <name>Остановлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Испытания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторонняяПоверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудование</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Канбаны</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>МТК</name>
      <type>
        <types>DocumentRef.МаршрутнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прессформы</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Прессформа</name>
      <type>
        <types>CatalogRef.ТехОснастка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/МаршрутнаяКарта/МаршрутнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутнаяКарта</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.РемонтнаяКарта</basedOn>
  <basedOn>Document.СписаниеМПЗПрочее</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИнициатор</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредполагаемогоОкончанияОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОстановки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗОстановки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.СтандартныеКомментарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остановки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредполагаемая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonForms/УдалениеМТК/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
ТЧ = ТаблицаМТК.Добавить();
ТЧ.МТК = Параметры.МТК;
ТЧ.Количество = Параметры.МТК.Количество;
ТЧ.МожноУдалить = ПроверитьМТК(ТЧ);
КолСтр = ТаблицаМТК.Количество()-1;
МожноУдалить = ТаблицаМТК[КолСтр].МожноУдалить;
	Для к = 0 По КолСтр - 1 Цикл
		Если Не МожноУдалить Тогда
		ТаблицаМТК[КолСтр-к].МожноУдалить = Ложь;
		КонецЕсли;	
	МожноУдалить = ТаблицаМТК[КолСтр-к].МожноУдалить;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМТКПриАктивизацииСтроки(Элемент)
Элементы.УдалитьМТК.Доступность = Элементы.ТаблицаМТК.ТекущиеДанные.МожноУдалить;
КонецПроцедуры

&НаСервере
Функция ПроверитьМТК(ТЧ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныхЗаписей = РезультатЗапроса.Выбрать();
МожноУдалить = Истина;
	Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
	ТЧ_ПЗ = ТЧ.ТаблицаПЗ.Добавить();
	ТЧ_ПЗ.ПЗ = ВыборкаДетальныхЗаписей.Ссылка;
	ТЧ_ПЗ.ДатаЗапуска = ВыборкаДетальныхЗаписей.Ссылка.ДатаЗапуска;	
		Если ЗначениеЗаполнено(ВыборкаДетальныхЗаписей.Ссылка.ДатаЗапуска) Тогда
		ТЧ_ПЗ.МожноУдалить = Ложь;
		МожноУдалить = Ложь;
		Иначе
		ТЧ_ПЗ.МожноУдалить = Истина;
		КонецЕсли;	
	КонецЦикла;
ПолучитьПодчиненныеМТК(ТЧ);
Возврат(МожноУдалить);
КонецФункции

&НаСервере
Процедура ПолучитьПодчиненныеМТК(ТЧ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ТЧ_П = ТаблицаМТК.Добавить();
	ТЧ_П.МТК = ВыборкаДетальныеЗаписи.Ссылка;
	ТЧ_П.Количество = ВыборкаДетальныеЗаписи.Ссылка.Количество;
	ТЧ_П.МожноУдалить = ПроверитьМТК(ТЧ_П);
	ТЧ_П.Подчиненная = Истина;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Функция УдалитьОсновнуюМТК(Стр)
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ТЧ = ТаблицаМТК.НайтиПоИдентификатору(Стр);
		Если ТЧ.МожноУдалить Тогда
		Запрос = Новый Запрос;

			Для Каждого ТЧ Из ТаблицаМТК Цикл
				Если ТЧ.МожноУдалить Тогда
					Если ТЧ.МТК.Подразделение.ОформлятьПустыеКанбаны = 2 Тогда
					НаборЗаписей = РегистрыСведений.ОборотКанбанов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.МестоХранения.Установить(ТЧ.МТК.МестоХраненияПотребитель); 
					НаборЗаписей.Отбор.МестоХраненияОтправитель.Установить(ТЧ.МТК.Линейка.МестоХраненияГП);
					НаборЗаписей.Отбор.Подразделение.Установить(ТЧ.МТК.Подразделение);
					НаборЗаписей.Отбор.МПЗ.Установить(ТЧ.МТК.Номенклатура);
					НаборЗаписей.Отбор.НомерЯчейки.Установить(ТЧ.МТК.НомерЯчейки);
					НаборЗаписей.Прочитать();
						Для Каждого Запись Из НаборЗаписей Цикл
						    Если Не ЗначениеЗаполнено(Запись.ДатаПередачи) Тогда
							НаборЗаписей.Удалить(Запись);
							Прервать;
						    КонецЕсли;
						КонецЦикла;
					НаборЗаписей.Записать();
					КонецЕсли; 
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ПроизводственноеЗадание.Ссылка
					|ИЗ
					|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
					|ГДЕ
					|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";
				Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();		
					ПЗ.Удалить();
					КонецЦикла;
				МТК = ТЧ.МТК.ПолучитьОбъект();
				МТК.Удалить();	
				Иначе
				МТК = ТЧ.МТК.ПолучитьОбъект();
				МТК.ДокументОснование = Неопределено;
				МТК.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли; 
			КонецЦикла;			
		Иначе	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МаршрутнаяКарта.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
			|ГДЕ
			|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МТК = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			МТК.ДокументОснование = Неопределено;
			МТК.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
		МТК = ТЧ.МТК.ПолучитьОбъект();
		МТК.Удалить();		
		КонецЕсли;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Истина);
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);	
	КонецПопытки;
КонецФункции

&НаСервере
Функция УдалитьПодчиненнуюМТК(Стр)
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
	ТЧ = ТаблицаМТК.НайтиПоИдентификатору(Стр);
		Если ТЧ.МожноУдалить Тогда
			Если ТЧ.МТК.Подразделение.ОформлятьПустыеКанбаны = 2 Тогда
			НаборЗаписей = РегистрыСведений.ОборотКанбанов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.МестоХранения.Установить(ТЧ.МТК.МестоХраненияПотребитель); 
			НаборЗаписей.Отбор.МестоХраненияОтправитель.Установить(ТЧ.МТК.Линейка.МестоХраненияГП);
			НаборЗаписей.Отбор.Подразделение.Установить(ТЧ.МТК.Подразделение);
			НаборЗаписей.Отбор.МПЗ.Установить(ТЧ.МТК.Номенклатура);
			НаборЗаписей.Отбор.НомерЯчейки.Установить(ТЧ.МТК.НомерЯчейки);
			НаборЗаписей.Прочитать();
				Для Каждого Запись Из НаборЗаписей Цикл
				    Если Не ЗначениеЗаполнено(Запись.ДатаПередачи) Тогда
					НаборЗаписей.Удалить(Запись);
					Прервать;
				    КонецЕсли;
				КонецЦикла;
			НаборЗаписей.Записать();
			КонецЕсли; 
		Запрос = Новый Запрос;

		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроизводственноеЗадание.Ссылка
			|ИЗ
			|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
			|ГДЕ
			|	ПроизводственноеЗадание.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ТЧ.МТК);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПЗ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();		
			ПЗ.Удалить();
			КонецЦикла;
		МТК = ТЧ.МТК.ПолучитьОбъект();
		МТК.Удалить();	
		КонецЕсли; 		
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Возврат(Истина);
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());
	Возврат(Ложь);	
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура УдалитьМТК(Команда)
Стр = Элементы.ТаблицаМТК.ТекущаяСтрока;
	Если Стр = 0 Тогда
	Результат = УдалитьОсновнуюМТК(Стр);
	Иначе		 
	Результат = УдалитьПодчиненнуюМТК(Стр);
	КонецЕсли; 
		Если Результат Тогда
		ЭтаФорма.Закрыть(Истина);	
		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьПЗНаСервере()
СписокСтр = Новый СписокЗначений;

	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Для Каждого ТЧ Из ТаблицаМТК Цикл
		КолУдаленных = 0;
			Для Каждого ТЧ_ПЗ Из ТЧ.ТаблицаПЗ Цикл
				Если ТЧ_ПЗ.Пометка Тогда
				ПЗ = ТЧ_ПЗ.ПЗ.ПолучитьОбъект();		
				КолУдаленных = КолУдаленных + ПЗ.Количество;
				ПЗ.Удалить();
				КонецЕсли;
			КонецЦикла;
		КолОстПВ = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),ТЧ.МТК);
		МТК = ТЧ.МТК.ПолучитьОбъект();
		МТК.Количество = МТК.Количество - КолУдаленных;
			Если КолОстПВ = МТК.Количество Тогда
			МТК.Статус = 3;			
			КонецЕсли; 
		МТК.Записать(РежимЗаписиДокумента.Проведение);
		ТЧ.Количество = МТК.Количество;  
		КонецЦикла;	
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;	
		Для Каждого ТЧ Из ТаблицаМТК Цикл
		СписокСтр.Очистить();
		ТаблицаПЗ = ТЧ.ТаблицаПЗ;
			Для Каждого ТЧ_ПЗ Из ТаблицаПЗ Цикл
				Если ТЧ_ПЗ.Пометка Тогда
				СписокСтр.Добавить(ТЧ_ПЗ);
				КонецЕсли;
			КонецЦикла; 
				Для каждого Стр Из СписокСтр Цикл
				ТаблицаПЗ.Удалить(Стр.Значение);
				КонецЦикла;
		КонецЦикла;		
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки());	
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПЗ(Команда)
УдалитьПЗНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры
